#### CurtainSystemType Property

---

|  |
| --- |
| CurtainSystem Class   See Also |

get or set the type of the CurtainSystem.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurtainSystemType CurtainSystemType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CurtainSystemType As CurtainSystemType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property CurtainSystemType^ CurtainSystemType { 	CurtainSystemType^ get (); 	void set (CurtainSystemType^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the specified parameter curtainSystemType is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the type of the CurtainSystem cannot be changed to the specified one. |

# See Also

CurtainSystem Class

Autodesk.Revit.DB Namespace